#include <iostream>

using namespace std;

int main()
{
	printf("%-5s%-11s%-25s%-11s%%", "Код", "Заединиц", "Валюты", "РублейРФ\n"); 
	cout<<"-----------------------------------------------------"; 
	printf("%-5s%-11d%-25s%-11.4f%%", "AUD", 1, "Австралийскийдоллар", 44.9883); 
	printf("%-5s%-11d%-25s%-11.4f%%", "GBP", 1, "Фунтстерлингов", 86.8429); 
	printf("%-5s%-11d%-25s%-11.4f%%", "BYR", 10000, "Белорусскийрубль", 39.7716); 
	printf("%-5s%-11d%-25s%-11.4f%%", "DKK", 10, "Датскаякрона", 84.9192); 
	printf("%-5s%-11d%-25s%-11.4f%%", "USD", 1, "ДолларСША", 58.4643); 
	printf("%-5s%-11d%-25s%-11.4f%%", "EUR", 1, "Евро", 63.3695); 
	printf("%-5s%-11d%-25s%-11.4f%%", "KZT", 100, "Казахскийтенге", 31.4654);
	system("pause");
}